api/modules/v1/models/User.php

    public  function saveAllowance($request, $action, $allowance, $timestamp){
        $this->allowance = $allowance;
        $this->allowance_updated_at = $timestamp;
        $this->save();
---
UPDATE `user` SET `updated_at`=1477532095, `allowance_updated_at`=1477532095 WHERE `id`='12'

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`access_token`='dOg0EKvyRhP5vazXWu6GV6Tp_OKiUeMq') AND (`status`=10)