api/models/User.php

SELECT * FROM `user` WHERE (`phoneNumber`='13681086548') AND (`status`=10)
---
    public static function findByPhoneNumber($phoneNumber)
    {
        return static::findOne(['phoneNumber' => $phoneNumber, 'status' => self::STATUS_ACTIVE]);